[
  {
    "Q": "How does C3 work?",
    "A": "C3 is a containerized blockchain technology for launching and executing complex applications free of artificial compute restrictions."
  },

  {
    "Q": "Is C3 ready to use?",
    "A": "C3 is still in heavy development with a production stable release launch date goal of Q4 2019"
  },

  {
    "Q": "Is C3 a blockchain?",
    "A": "Yes, C3 is blockchain software technology which can be utilized as a Layer 2 or as a standalone chain."
  },

  {
    "Q": "How does C3 work as a Layer 2?",
    "A": "C3 works as a Layer 2 by checkpointing the merkle root of it's blocks at a predefined interval to a Layer 1."
  },

  {
    "Q": "How does C3 know that a state will be deterministic?",
    "A": "The developer of the dApp is responsible for creating deterministic states. A C3 node does not inherently know that a state will be deterministic however if the state is not deterministic then validators will never reach consensus and the transaction will fail."
  },

  {
    "Q": "How does C3 prevent a validator from running a dApp transaction for forever?",
    "A": "C3 validators will broadcast transaction execution reports after processing a block. This transparency layer will give other validators insights to how long a transaction is expected to run. The first execution report will be generated by the dApp developers by running tests and benchmarks before submitting their dApp."
  },

  {
    "Q": "How does C3 prevent DDOS attacks?",
    "A": "C3 validators will reject transactions from an account holder that does not have enough C3 coin to fund the transactions. This will prevent the transaction from making in it into the mempool."
  },

  {
    "Q": "What is the max block size in C3?",
    "A": "Block size and maximum number of transaction that be in a block is still TBD."
  },

  {
    "Q": "What happens if a C3 validator can’t process the transaction because of hardware requirements?",
    "A": "The validator will have to skip that particular transaction. Validators will be grouped into groups with similar compute requirements (similar to AWS tiers)."
  },

  {
    "Q": "What if all validators can’t validate a block?",
    "A": "Only a subset of validator are required to validate the block. If less than 2/3 can't validate the block then the block is considered invalid and won't be part of the chain."
  },

  {
    "Q": "Does C3 store event logs (like in Ethereum)?",
    "A": "Not currently. This feature is planned however."
  },

  {
    "Q": "Does C3 store return data (like in Ethereum)?",
    "A": "Not currently. This feature is planned however."
  },

  {
    "Q": "What determines the state transaction price in C3?",
    "A": "The open market will determine the average price for a transaction given the historical reports for costs of executing transactions."
  },

  {
    "Q": "How does C3 deal with governance?",
    "A": "C3 plans on having a TCR-like system for accepting C3 Improvement Proposals but the details are still TBD."
  },

  {
    "Q": "What is a C3 state block?",
    "A": "A state block in C3 is a dApps own state chain. Every transaction or group of transaction processed by a dApp results in a new state block which added to the dApp state chain. The dApp state chain's merkle root becomes part of the main chain block."
  },

  {
    "Q": "Where can I see code samples?",
    "A": "All code is open source and available on Github: https://github.com/c3systems"
  },

  {
    "Q": "What is C3 licensed under?",
    "A": "C3 is licensed under the GNU AGPL v3.0 license."
  },

  {
    "Q": "How does C3 compare to Docker?",
    "A": "C3 uses Docker containers for sandboxing and allowing developer to write smart contract business logic and any language they like."
  },

  {
    "Q": "How does C3 compare to Polkadot?",
    "A": "C3 is not competing with Polkadot and C3 plans on launching as a parachain on Polkadot once the Polkadot network is live."
  },

  {
    "Q": "How does C3 compare to Cosmos?",
    "A": "Cosmos is focusing on transfer of value, while C3 is providing a container runtime to be used with Polkadot."
  },

  {
    "Q": "How does C3 compare to Tendermint?",
    "A": "Tendermint is a consensus algorithm while C3 is providing a container runtime to be used with Polkadot. Polkadot provides multiple consensus algorithm, including Tendermint."
  },

  {
    "Q": "How does C3 compare to Golem?",
    "A": "Golem is focused on a marketplace for off-chain computation similar to render farms, while C3 is providing a container runtime to be used with Polkadot."
  },

  {
    "Q": "How does C3 compare to Trubit?",
    "A": "Truebit is focused on off-chain WASM computation with dispute verification on-chain, while C3 is providing a container runtime to be used with Polkadot."
  },

  {
    "Q": "How does C3 interoperate with other blockchains such as Ethereum and EOS?",
    "A": "C3 will utilize the Polkadot network of bridgechain to allow transfer of value between seperate chains."
  },

  {
    "Q": "How does can machine learning libraries like Tensorflow be used in C3?",
    "A": "C3's containerized runtime means that as a developer you can use any software systems you like so long the end state is reproducible in a deterministic fashion. This means that your machine learning model must be trained using seeded random number generators and not rely on dynamic variables like system time."
  },

  {
    "Q": "What are the incentives for block producers on C3?",
    "A": "Incentives will be transaction fees."
  },

  {
    "Q": "Does a user have to pay for every transaction on C3?",
    "A": "Yes, the user can pay for each transaction or pre-pay for resources in order to make transactions free for users."
  },

  {
    "Q": "How does C3 compare to platforms using EVM or WASM?",
    "A": "C3 is providing a container runtime which as a developer means that you can use any language and software libraries you like. EVM and WASM require that the source code is compiled to their respective bytecode in order to be executed by the VM."
  },

  {
    "Q": "Does C3 compile it's smart contracts to EVM or WASM?",
    "A": "No, C3 does not compile down it's smart contracts to bytecode for other platforms. C3 smart contracts are executed as container without compilation."
  },

  {
    "Q": "How many nodes in the network execute the smart contracts on C3?",
    "A": "2/3 of validators in the network must agree on the validity of a block for it to become comitted. These means that validators are incentives to run the transactions to verify the state."
  },

  {
    "Q": "How does C3 as a Layer 2 compare to other Layer 2 solutions?",
    "A": "C3 as a layer 2 will checkpoint state to the Layer 1 (in a way similar to Loom Network). C3 plans on being Layer 1 agonistic."
  },

  {
    "Q": "Is each dApp on C3 it's on blockchain?",
    "A": "No, each dApp is not an entirely new blockchain and does not have each own set of validators but as a developer you have the freedom to launch an entire parachain for your dApp if it makes sense."
  },

  {
    "Q": "Are transactions executed on-chain or off-chain?",
    "A": "Transactions are executed by validators on-chain."
  },

  {
    "Q": "How does C3 as a company make money?",
    "A": "C3 Labs has an enterprise profit-generating branch to support the open source foundation branch. C3 does not plan on making money from a one-time token generation event because it's not sustainable as a business model."
  },

  {
    "Q": "How do C3 coins work?",
    "A": "C3 coins will function as incentives for block producers to process transaction as well as to prevent DDoS flooding."
  },

  {
    "Q": "Will C3 have a token sale?",
    "A": "Not in the near future."
  },

  {
    "Q": "Are there block rewards in C3?",
    "A": "This is TBD."
  },

  {
    "Q": "When did C3 start",
    "A": "C3 initial planning and development started in July 2017."
  }

]
